Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K17.tmx
Source language: en_us
Languages: zh_cn

source: SMOKE SCREEN
zh_cn: 烟幕

source: CHAPTER 1
zh_cn: 第一章

source: Raley pulled open the rusty screen door, its hinges squealing.
zh_cn: 雷利拉开锈迹斑斑的纱门时，门铰发出咯吱咯吱的声音。

source: "Hey! You in here?"
zh_cn: “哎呀，你就住这里？”

source: "Ain't I usually?"
zh_cn: “我一直住这里！”

source: A curl of faded red paint flaked off when the wood frame slapped closed behind Raley as he stepped into the one-room cabin.
zh_cn: 雷利走进那个单间小屋，身后木门框“啪”地关上时，一团褪色的红漆应声而落。

source: It smelled of fried pork and the mouse-gnawed Army blanket on the cot in the corner.
zh_cn: 小屋弥漫着一股炸猪肉和角落小床上老鼠啃过的军用毛毯发出的异味。

source: It took a moment for his eyes to adjust to the dimness and find the old man.
zh_cn: 过了一会儿，雷利的眼睛才习惯屋内昏暗的环境并看到那个老头。

source: He was sitting at a three-legged table, hunched over a cup of coffee like a dog guarding a hard-won bone, staring into the snowy screen of a black-and-white television.
zh_cn: 老头坐在一张三条腿的餐桌旁，像狗护着费尽力气才抢得的骨头一样弓着腰捂着一杯咖啡，眼睛盯着满是雪花的黑白电视屏幕。

source: Ghostly images flickered in and out. There was no audio except for a static hiss.
zh_cn: 幽灵般的图像在屏幕上闪闪烁烁，但是，除了静电发出的沙沙声外，没有任何声音。

source: "Good morning."
zh_cn: “早上好。”

source: The old man snorted a welcome through his sheaves of nasal hair.
zh_cn: 那老头抖抖鼻毛哼哼鼻子以示欢迎。

source: "He'p yourself." He nodded toward the enamel coffeepot on the stove.
zh_cn: 他朝炉上的搪瓷咖啡壶点了一下头，说：“喝点吧。

source: "Can't recommend the cream. It curdled overnight."
zh_cn: 乳酪昨夜坏了，就别加了。”

source: Raley stepped over the three hounds lying motionless on the floor and went to the refrigerator that was jammed between an antique pie safe, which served as a pantry, and a drafting table, which served no purpose whatsoever except to collect dust and further reduce the floor space in the crowded cabin.
zh_cn: 雷利从一动不动地躺在地上的三只猎狗身上跨过，走向挤在充当食品柜的老式碗橱与高低可调的制图桌之间的冰箱。那张桌子，除了收集灰尘和进一步减少拥挤的小屋空间外，再也没有任何用途。

source: The handle on the fridge door had broken off, probably decades ago, but if you pressed your fingers just right into the soft rubber sealant in the crack, you could pry it open.
zh_cn: 冰箱门把手已折断，恐怕是几十年前就断了。但是，如果把手指插进门缝中的密封软胶，还是可以掰开冰箱门的。

source: "I brought you some catfish."
zh_cn: “给你带了点鲶鱼。”

source: Raley set the newspaper bundle on one of the rusty wire shelves, then quickly shut the door against the mingled odors of cream gone bad and general spoilage.
zh_cn: 雷利把一卷包着鲶鱼的报纸放在其中一个锈迹斑斑的冰箱格子上后，迅速关上冰箱门，以阻挡已经变质的乳酪和完全腐烂的食物发出的混合异味。

source: "Much obliged."
zh_cn: “非常感谢。”

source: "You're welcome." The coffee probably had been boiled several times and would be the consistency of molasses.
zh_cn: “不用谢。”那咖啡很可能已经煮过好几回，而且弄得跟糖浆一样。

source: Without cream to dilute it, Raley thought it better to pass.
zh_cn: 既然没有乳酪调和咖啡，雷利觉得不喝为妙。

source: He glanced at the silent TV. "You need to adjust your rabbit ears."
zh_cn: 雷利瞥了一眼无声电视，说：“得调调天线。”

source: "Ain't the rabbit ears.
zh_cn: “不关天线的事。

source: I turned off the sound."
zh_cn: 我关了声音。”

source: "How come?"
zh_cn: “为啥？”

source: The old man replied with one of his customary harrumphs that said he couldn't be bothered to answer.
zh_cn: 那老头习惯性地哼哼鼻子，表示懒得回答。

source: A self-proclaimed recluse, he had lived in voluntary exile ever since "the war," although which war had never been specified. He had as little as possible to do with other Homo sapiens.
zh_cn: 自称为隐士的他，自从“那场战争”爆发以来，就一直自我放逐至今。但是，他却从未说明究竟是哪场战争，而且尽可能不与其他人来往。

source: Shortly after Raley had moved into the vicinity, the two had come upon each other in the woods.
zh_cn: 此前，雷利搬到那个地方不久，他俩就在林中相遇。

source: Raley was staring down into the beady eyes of a dead opossum when the old man came crashing through the underbrush and said, "Don't even think about it."
zh_cn: 雷利当时低头在看一只死负鼠圆鼓鼓的双眼，那位老头从灌木丛中冲过来，说：“休想拿走。”

source: "About what?"
zh_cn: “休想什么？”

source: "About taking my possum."
zh_cn: “休想拿走我的负鼠。”

source: Touching the bloated, flyblown, limp body with the pink, hairless tail and horrible stench was the last thing Raley intended to do.
zh_cn: 雷利最讨厌的，就是触摸臃肿、软绵绵、布满苍蝇卵、带有粉色无毛尾巴且发出恶臭的躯体。

source: He raised his hands in surrender and stood aside so the barefoot old man in stained overalls could retrieve his kill from the metal jaws of the small trap.
zh_cn: 他举手以示放弃并站在一旁，让那位穿着脏兮兮的工作裤的光脚老头，可以从那个小小的诱捕夹子的金属钳夹上取得其猎物。

source: "Way you been stampin' around out here, it's a wonder to me it ain't you caught in this trap instead of the possum," he grumbled.
zh_cn: “你，常在这里窜来窜去吧。真奇怪，夹住的不是你，而是负鼠。”老头嘟嚷着。

source: Raley wasn't aware that anyone lived within miles of the cabin he'd recently purchased.
zh_cn: 雷利并未意识到，在他最近购买的小屋数英里范围内，还住有其他人。

source: He'd rather not have had a neighbor of any kind, but especially one who kept track of his comings and goings.
zh_cn: 他不希望与任何人作邻居，尤其不希望与知道他行踪的人作邻居。

source: As the old man stood up, his knees protested in loud pops and snaps, which caused him to grimace and mutter a string of curses.
zh_cn: 那老头起身时，其膝盖发出喀嚓喀嚓的抗议声，脸上浮现出痛苦的表情，口中骂声不断。

source: With the carcass dangling from his hand, the old man looked Raley over, from his baseball cap and bearded face to the toes of his hiking boots.
zh_cn: 他手里晃动着负鼠尸体，眼睛上下打量着雷利，从头戴的棒球帽和胡须巴扎的脸一直看至穿着登山鞋的足尖。

source: Inspection complete, the old man spat tobacco juice into the dirt to express his opinion of what he saw. "Man's got a right to walk in the woods," he said. "Just don't go messin' with my traps."
zh_cn: 检查完毕，老头将烟液一口啐到地上，发表其看法：“你是有权在林中散步，但别弄乱了我的夹子。”

source: "It would help me to know where they are."
zh_cn: “它可以帮我确定猎物在哪里。”

source: The old man's cracked lips spread into a wide grin, revealing tobacco-stained stubs that once were teeth.
zh_cn: 老头皱裂的嘴唇张得开开的，露齿而笑，烟草熏黑的残余牙根暴露无遗。

source: "Wouldn't it though?"
zh_cn: “不是吗？”他咯咯地笑着，转身而去：“我打赌，你会发现它们的。”

source: Still chuckling, he turned away. "You'll find ¡®em, I'm bettin'." Raley could hear his laughter long after he disappeared into the dense foliage.
zh_cn: 雷利还在听着他吃吃的笑声，他的人影却早已消失在浓密的树林中了。

source: Over the ensuing months, they'd accidentally bumped into each other in the woods several times.
zh_cn: 随后几个月，他们好几次在林中不期而遇。

source: At least to Raley these were chance meetings.
zh_cn: 至少对雷利而言，是偶然相遇。

source: He reasoned the old man made himself visible when he wanted to and didn't when he was disinclined to give his new neighbor even a grunt of a greeting.
zh_cn: 他认为，老头是想现身时就现身，不想和新邻居甚至哼哈打一声招呼时就不现身。

source: One hot afternoon, they met in the doorway of the general store in the nearest town.
zh_cn: 一个炎热的午后，在最近城镇的百货商店门口，他们又相遇。

source: Raley was coming in, the old man going out. They nodded to each other.
zh_cn: 雷利进去，老头出来，双方点了点头。

source: Later, when Raley left with several sacks of groceries, he noticed the old man sitting in a chair on the shaded porch of the store, fanning himself with his straw hat.
zh_cn: 后来雷利提着几袋东西离开时，注意到老头坐在商店遮荫门廊的椅子上，用草帽给他自己扇风。

source: Acting on impulse, Raley peeled a cold can of beer from the plastic webbing and tossed it to the old man, who, revealing excellent reflexes, caught it in one hand.
zh_cn: 雷利一时冲动，从塑料网袋中拿出一罐冰凉啤酒抛给他。老头反应神速，只手接住。

source: Raley stowed his groceries in the bed of his pickup and climbed into the cab.
zh_cn: 雷利将所购物品塞入皮卡车箱，而后爬进驾驶室。

source: The old man regarded him with patent suspicion as he put the truck in reverse and backed away, but Raley noticed that he'd popped the top on the beer.
zh_cn: 在他倒车掉头回去时，老头满腹狐疑地看着他，但是，雷利注意到，老头拉开了那罐啤酒盖。

source: The following morning there was hard knocking on Raley's door.
zh_cn: 次日早上，雷利听到重重的敲门声。

source: This being a first, he approached the door cautiously.
zh_cn: 这是头一回听到敲门声，雷利小心翼翼地打开门。

source: The old man was there, holding a chipped ceramic bowl containing a heap of some raw animal flesh that Raley couldn't identify.
zh_cn: 那老头站在门口，手里拿着一只破损的陶瓷碗，碗里装着一团生肉。

source: He feared it was carrion that even the trio of hounds had rejected.
zh_cn: 雷利看不出是什么动物的肉，担心是甚至连那三只猎狗也嫌弃的腐肉。

source: "In exchange for the beer.
zh_cn: “换你的啤酒。

source: I don't like bein' beholden to nobody."
zh_cn: 我不想欠任何人情。”

source: Raley took the bowl thrust at him. "Thanks."
zh_cn: 雷利将碗塞回给他：“谢谢。”

source: His visitor turned and walked down the steps. Raley called after him, "What's your name?"
zh_cn: 客人转身走下台阶，雷利追喊道：“你叫什么名字？”

source: "Who wants to know?"
zh_cn: “谁想知道？”

source: "Raley Gannon."
zh_cn: “雷利甘农。”

source: The old man hesitated, then grumbled, "Delno Pickens."
zh_cn: 老头犹豫了一下，咕哝道：“德尔诺皮肯斯。”

source: From that morning, they developed a quasi friendship founded on loneliness and a shared reluctance for interaction with other people.
zh_cn: 从那天早上起，因孤独而又不愿意与其他人交往的他俩，就建立了准朋友关系。

source: The sum-total value of Delno's possessions wouldn't be a hundred dollars.
zh_cn: 德尔诺的家什总值不到一百美元。

source: He was always dragging home something he'd salvaged from God knew where, items he had no practical use for.
zh_cn: 他经常往家里拖带一些东西。那些上帝才知道来历的东西，对他并没有什么用处。

source: His cabin was situated on stilts to prevent it from flooding when the Combahee overflowed its banks.
zh_cn: 为防止康贝河水漫过河岸而浸水，他的小屋建在桩上。

source: Junk had been stuffed into the crawl space beneath the structure, as though to provide a more solid foundation.
zh_cn: 房子下的水电管道间隙，塞满了无用的东西，似乎那样就可以加固地基。

source: The area surrounding the cabin was also littered with junk that was never utilized so far as Raley could tell.
zh_cn: 小屋周围的空地，也堆满了在雷利看来永远不会有用的杂七杂八的东西。

source: Collecting it seemed more important to Delno than the articles themselves.
zh_cn: 对德尔诺而言，收集这些物品比那些物品本身，似乎更重要。

source: He drove a truck that Raley called Frankenstein because it was made of parts Delno had assembled himself, held together with baling wire and duct tape.
zh_cn: 德尔诺驾驶的卡车，雷利称之为“拼装怪车” ，因为那是由德尔诺用他自己收集的零配件组装的，用打包钢丝和布基胶带绑在一起。

source: It was a miracle to Raley that he ever got the contraption started, but as Delno said, "It ain't pretty, but it gets me anywhere I want to go."
zh_cn: 雷利觉得，老头可以让那个奇妙装置跑起来，真是个奇迹，但正如德尔诺所说：“虽然不中看，但我想去哪里，它就可以把我带到哪里。”

source: He would eat anything. Anything. Anything he could knock from a tree, trap, or pull out of the river.
zh_cn: 老头任何东西都吃，任何东西！树上敲下的，夹子夹住的，河里捞出来的。

source: But whatever he had, once their friendship had been established, he was always willing to share it.
zh_cn: 而且一旦成为朋友，无论得到什么东西，他都愿意分享。

source: Surprisingly, he was very well read and conversant on subjects which, to look at him, one wouldn't have expected him to have even a passing knowledge of.
zh_cn: 奇怪的是，老头非常博学，熟悉从外表看他甚至根本考不及格的科目。

source: Raley came to suspect that his hillbilly accent and vocabulary were affected.
zh_cn: 雷利怀疑，他的乡巴佬口音和用语都是故意伪装的。

source: Like the squalor he lived in, they were protests against a former life.
zh_cn: 像他居住的肮脏环境一样，它们与他从前的生活形成鲜明对比。

source: But whatever that former life had entailed remained Delno's secret.
zh_cn: 但是，无论从前过着怎样的生活，那都属于德尔诺的秘密。

source: He never mentioned a hometown, his childhood or parents, an occupation, children, or wife.
zh_cn: 德尔诺从未提起过他的故乡、童年、父母、妻子或者孩子。

source: Beyond his hounds, he talked to no one except Raley.
zh_cn: 除猎狗外，他从未和雷利以外的人讲过一句话。

source: Intimate relationships were limited to a stack of old nudie magazines with well-thumbed pages, which he kept on the floor beneath his cot.
zh_cn: 和他存在亲密关系的，仅限于他放在小床下地板上的一堆经常翻阅的裸体色情杂志。

source: Raley shared nothing personal with Delno, either.
zh_cn: 雷利与德尔诺也不存在亲密关系。

source: Not for the first two years of their acquaintanceship.
zh_cn: 起码在他们认识的头两年，不存在那种关系。

source: And then one evening at sunset, Delno showed up at Raley's cabin, bringing with him two Mason jars filled with a murky liquid that he'd fermented himself.
zh_cn: 后来的一个日落黄昏，德尔诺来到雷利的小屋，手里拿着两个金属螺盖玻璃瓶，那两个瓶子装满了令德尔诺自己兴奋不已的浑浊液体。

source: "Haven't seen you in over a week. Where you been?"
zh_cn: “一周不见，去哪了？”

source: "Here."
zh_cn: “就在这里。”

source: Raley didn't want company, but Delno elbowed his way inside anyway.
zh_cn: 雷利不想接客，德尔诺却不管不顾地挤了进去。

source: "Thought you might be needin' a swig or two." Giving Raley one of his scornful once-overs, he added, "Lookin' at you, I'd say my hunch was right.
zh_cn: “我想你会痛饮一两口。”他轻蔑地扫视雷利一遍后，继续说：“看见你，我得说我的直觉很准。

source: You appear to be in bad shape.
zh_cn: 你看起来身体不好。

source: Could smell you as I was coming up the steps."
zh_cn: 我走上台阶时，就闻到了你身上的异味。”

source: "You're a fine one to criticize someone else's appearance and personal hygiene."
zh_cn: “对他人外貌和个人卫生，你倒挺善于评头论足的。”

source: "Who'd you call?"
zh_cn: “给谁打过电话？”

source: "What?"
zh_cn: “你说什么？”

source: "That blabbermouth that runs the cash register at the store?
zh_cn: “记得那商店收银的长舌妇吗？

source: The one with her hair piled up high, wears long, dangly earrings? Told me you come in there last week, got a handful of change, and fed it into the pay phone outside.
zh_cn: 那个发髻高高盘起、戴着长长的晃来晃去的耳环的女人？她告诉我，上周你去过那里，换了一些零钱，投入外面的公用电话。

source: Said you talked a few minutes, then hung up, looking like you was ready to kill somebody.
zh_cn: 她说，你讲了几分钟就挂了，你好像要杀人。

source: Got in your truck and took outta there without even paying for your groceries."
zh_cn: 你甚至连买东西的钱都没有付，就上车离开那里。”

source: He uncapped one of the jars and passed it to Raley, who sniffed the contents, then shook his head and passed it back.
zh_cn: 他打开其中一瓶的瓶盖，递给雷利。雷利用鼻子闻了闻，摇摇头，递回给他。

source: "So, I'm askin'," Delno continued after taking a hefty swallow from the jar, "who'd you call?"
zh_cn: 德尔诺重重地喝了一口，继续问：“好了，我问你，给谁打过电话？”

source: It was dawn before Raley stopped talking.
zh_cn: 雷利这才开口说话，而且一直谈到破晓才停止。

source: By then, Delno had drained both jars. Raley was simply drained ¡ª emotionally, mentally, physically.
zh_cn: 到那时，德尔诺已喝干了两瓶酒，雷利简直是精疲力竭——感情上、精神上和肉体上。

source: It had been a painful but therapeutic catharsis.
zh_cn: 虽然很痛苦，但却是一种精神宣泄。

source: He had lanced a dozen wounds.
zh_cn: 他刺开了许多伤口。

source: With nothing more to say and no breath left to say it, Raley looked over at the old man, who had listened for hours without making a single comment.
zh_cn: 再也无可诉说也没有力气诉说的雷利，抬头看着不发一语倾听了数小时的老头。

source: The expression on the creased, leathery face was one of profound sadness.
zh_cn: 老头扭曲的皮革似的脸上浮现出一种深深的忧伤。

source: His eyes were naked and unguarded for the first time since Raley had known him, and Raley knew he was looking straight into the soul of a man who'd experienced indescribable heartache.
zh_cn: 自雷利认识他以来，老头的眼睛头一回毫无掩饰，毫无防备。雷利明白，老头正在直视经历了难以言说的心痛之人的灵魂。

source: It seemed Delno Pickens had collected all the misery and injustice in the world and packed it into that one hopeless gaze.
zh_cn: 德尔诺皮肯斯似乎收集了人间所有的苦难和不公，并将其打包塞入绝望的凝视中。

source: Then he sighed, and in one of the rare times they'd ever made physical contact, reached across the space separating them and patted Raley on the knee. "Go wash your armpits before the stink of you makes me puke up all that good liquor.
zh_cn: 后来，老头叹了一口气，跨过分隔彼此的空间，拍了拍雷利的膝盖，这是他们罕见的一次身体接触：“去洗洗你的腋窝，别让你那难闻的臭味熏得我把所有的好酒都呕了出来。

source: I'll cook you some breakfast."
zh_cn: 我给你煮点早餐吧。”

source: They never again referred to anything Raley had told him that night.
zh_cn: 此后，他们再也没有提起那天晚上雷利告诉他的事情。

source: It was as though the long night had never happened.
zh_cn: 那个晚上，似乎是从未经历过的最漫长的夜晚。

source: But Raley never forgot the bleakness with which Delno had looked at him that morning.
zh_cn: 而且那天早上德尔诺看着他的忧郁眼神，雷利永远不会忘记。

source: And this morning when he raised his head from staring into his coffee mug and looked up at Raley, he was wearing that same expression of despair.
zh_cn: 而这个早上，当老头把盯着咖啡杯看的头抬起来看雷利时，仍然满脸是同样绝望的表情。

source: "What's the matter?" Raley's heart hitched, automatically thinking disaster.
zh_cn: “怎么了？”雷利心里咯噔一下，不由自主地想到了灾难。

source: A 747 loaded with passengers crashing into a mountainside. A presidential assassination. A terrorist attack on the scale of 9/11.
zh_cn: 搭载乘客的747路班车坠落山崖？总统被暗杀？恐怖分子实施了如911一样大规模的袭击？

source: "Don't go and do somethin' crazy, now, okay?" Delno said.
zh_cn: “别再去干疯狂的事情，行不？”德尔诺说。

source: "What happened?"
zh_cn: “发生什么事了？”

source: Muttering dire predictions about "nothin' good comin' outta this," Delno hitched his chin toward the TV.
zh_cn: 德尔诺喃喃地说完“来者不善”的可怕预言后，就抬起下巴对着电视。

source: Raley went over to the vintage set and turned the volume knob, then fiddled with the rabbit-ear antenna in the hope of getting a better picture.
zh_cn: 雷利走至老式电视机旁，打开音量按钮，摆弄天线，希望电视图像可以好起来。

source: The video remained erratic and the audio was scratchy, but within moments he had a clear understanding of what had happened and why Delno had dreaded telling him: Jay Burgess was dead.
zh_cn: 图像仍然不稳定，发出的还是沙沙声，但没一会儿，雷利就完全明白发生了什么，为什么德尔诺害怕告诉他： 杰伊伯吉斯死了!
